nithinkurian/firmware/src/bsp/stm32h743_nucleo/hal_cpu.c

#include "hal_cpu.h"
#include "rtos.h"
#include "stm32h743xx.h"

#define DUMMY_XPSP			0x01000000U

#define INTERRUPT_DISABLE()  do{__asm volatile ("MOV R0,#0x1"); asm volatile("MSR PRIMASK,R0"); } while(0)

#define INTERRUPT_ENABLE()  do{__asm volatile ("MOV R0,#0x0"); asm volatile("MSR PRIMASK,R0"); } while(0)

uint32_t SystemCoreClock = HSI_CLK;


void disable_interrupt()
{
	INTERRUPT_DISABLE();
}

void enable_interrupt()
{
	INTERRUPT_ENABLE();
}

void __disable_irq(void)
{
	__asm volatile ("cpsid i" : : : "memory");
}

void init_systick_timer(uint32_t tick_hz)
{
	//Systick timer is 24bit
	uint32_t count_value = (SYSTICK_TIM_CLK/tick_hz) - 1;

	//load the value in to SVR
	WRITE_REG(SYSTICK->RVR,0,count_value,0xFFFFFF);

	//do some settings
	SET_BIT(SYSTICK->CSR,1);  // Enables SysTick exception request.
	SET_BIT(SYSTICK->CSR,2);  // Indicates the clock source to	Processor clock (Internal)

	//start systick
	SET_BIT(SYSTICK->CSR,0);  // Enables the counter
}

__attribute__((naked)) void init_scheduler_stack(uint32_t sched_top_of_stack)
{
	__asm  volatile("MSR MSP,%0": : "r" (sched_top_of_stack) : );
	__asm  volatile("BX LR");
}

void pend_pendsv()
{
	//pend the pendsv exception
	SET_BIT(SCB->ICSR,28);
}

uint32_t task_stack_init(uint32_t psp_value, void (*task_handler)(void* parameters))
{
	uint32_t *pPSP;
	pPSP = (uint32_t *)psp_value;

	pPSP--;//XPSR
	*pPSP = DUMMY_XPSP;//0x00100000

	pPSP--;//PC
	*pPSP = (uint32_t) task_handler;

	pPSP--;//LR
	*pPSP = 0xFFFFFFFD;

	for(int j=0; j < 13; j++)
	{
		pPSP--;
		*pPSP = 0;
	}
	return (uint32_t)pPSP;
}